# Задача 2
# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
#  Из всех арифметических операций допускаются только +1 и -1. 
# Также нельзя использовать циклы.
# 2 2
# 4


def sum(a, b):
    # Базовый случай: если одно из чисел равно 0, возвращаем другое число
    if a == 0:
        return b
    elif b == 0:
        return a
    # Рекурсивный случай: вычитаем из обоих чисел по 1 и добавляем 2
    else:
        return sum(a - 1, b - 1) + 2

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(sum(a, b))
